# Importing libaries

In [1]:
#importing libraries
import pandas as pd
import numpy as np
import os
import polars as pl

path= r'C:\Users\ANITA BOADU\Instacart Basket Analysis'

#import customers dataframe
df_custs = pd.read_csv(os.path.join(path,'Data', 'Original Data', "customers.csv"),index_col=False)

In [2]:
#check the output
df_custs.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [3]:
#check the total numbers of rows and columns
df_custs.shape

(206209, 10)

In [4]:
df_custs.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206209 entries, 0 to 206208
Data columns (total 10 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   user_id       206209 non-null  int64
 1   First Name    194950 non-null  object
 2   Surnam        206209 non-null  object
 3   Gender        206209 non-null  object
 4   STATE         206209 non-null  object
 5   Age           206209 non-null  int64
 6   date_joined   206209 non-null  object
 7   n_dependants  206209 non-null  int64
 8   fam_status    206209 non-null  object
 9   income        206209 non-null  int64
dtypes: int64(4), object(6)
memory usage: 15.7+ MB

In [5]:
df_custs.describe()

             user_id            Age   n_dependants         income
count  206209.000000  206209.000000  206209.000000  206209.000000
mean   103105.000000      49.501646       1.499823   94632.852548
std     59527.555167      18.480962       1.118433   42473.786988
min         1.000000      18.000000       0.000000   25903.000000
25%     51553.000000      33.000000       0.000000   59874.000000
50%    103105.000000      49.000000       1.000000   93547.000000
75%    154657.000000      66.000000       3.000000  124244.000000
max    206209.000000      81.000000       3.000000  593901.000000

In [6]:
df_custs.dtypes

user_id          int64
First Name      object
Surnam          object
Gender          object
STATE           object
Age              int64
date_joined     object
n_dependants     int64
fam_status      object
income           int64
dtype: object

# 4.Wrangle the data so that it follows consistent logic; for example, rename columns with illogical names and drop columns that donâ€™t add anything to the analysis.

i need to make sure that the variable names are correct and consistent by using the same letter case

In [7]:
df_custs.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [8]:
#drop the first name and Surnam column since i already have user_id to identify.
df_custs = df_custs.drop(columns=["First Name", "Surnam"])

In [9]:
df_custs.head()

,user_id,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Female,Maryland,26,1/1/2017,1,married,40374

In [11]:
df_custs.tail()

,user_id,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
206204,168073,Female,North Carolina,44,4/1/2020,1,married,148828
206205,49635,Male,Hawaii,62,4/1/2020,3,married,168639
206206,135902,Female,Missouri,66,4/1/2020,2,married,53374
206207,81095,Female,California,27,4/1/2020,1,married,99799
206208,80148,Female,New York,55,4/1/2020,1,married,57095

In [12]:
#rename Gender as gender
df_custs.rename(columns = {'Gender' : 'gender'},inplace= True)

In [13]:
#rename STATE as state 
df_custs.rename(columns = {'STATE' : 'state'}, inplace = True)

In [14]:
#rename Age as age 
df_custs.rename(columns = {'Age' : 'age'}, inplace = True)

In [15]:
#rename n_dependants as number_of_dependants
df_custs.rename(columns = {'n_dependants' : 'number_of_dependants'}, inplace = True)

In [16]:
#rename fam_status as marital_status 
df_custs.rename(columns = {'fam_status' : 'marital_status'}, inplace = True)

In [17]:
df_custs.head()

,user_id,gender,state,age,date_joined,number_of_dependants,marital_status,income
0,26711,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Female,Maryland,26,1/1/2017,1,married,40374

#######All the variables follow the same naming format, and I have already removed the first name and surname columns for privacy purposes so that customers are identified strictly by their user_id.

# 5.Data quality and consistency checks

check for missing values and duplicates
convert any mixed type data

In [18]:
#To find missing values in data
df_custs.isnull().sum()

user_id                 0
gender                  0
state                   0
age                     0
date_joined             0
number_of_dependants    0
marital_status          0
income                  0
dtype: int64

####### The results tells us theres no missing values

In [19]:
#looking for duplicate 
df_dups= df_custs[df_custs.duplicated()]

In [20]:
#check the output
df_dups

Empty DataFrame
Columns: [user_id, gender, state, age, date_joined, number_of_dependants, marital_status, income]
Index: []

####### The reults here shows there no duplicates

In [21]:
#checking for mixed type data
df_custs.dtypes

user_id                  int64
gender                  object
state                   object
age                      int64
date_joined             object
number_of_dependants     int64
marital_status          object
income                   int64
dtype: object

####### No mixed data types were found in the customers DataFrame

## 6. Combine your customer data with the rest of your prepared Instacart data. (Hint: Make sure the key columns are the same data type!)

####I converted the prepared, aggregated data from Task 4.8 from a Pickle file

In [25]:
# Load the orders-products merged data
ords_prods_merge = pd.read_pickle(os.path.join(path, 'Data', 'Prepared Data', 'ords_prods_merge_4.9_.pkl'))

In [26]:
#check the output
ords_prods_merge.shape

(30356957, 20)

In [27]:
ords_prods_merge.describe()

,Unnamed: 0,order_id,user_id,order_number,order_dow,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,aisle_id,department_id,prices,max_order
count,3.035696e+07,3.035696e+07,3.035696e+07,3.035696e+07,3.035696e+07,3.035696e+07,3.035696e+07,3.035696e+07,3.035696e+07,3.035696e+07,3.032876e+07,3.032876e+07,3.032876e+07,3.035696e+07
mean,1.709803e+06,1.710736e+06,1.029339e+05,1.824695e+01,2.740779e+00,1.341124e+01,1.110414e+01,2.557424e+04,8.354155e+00,6.300634e-01,7.119183e+01,9.922036e+00,1.197725e+01,3.420227e+01
std,9.865039e+05,9.872460e+05,5.946892e+04,1.759162e+01,2.087926e+00,4.246811e+00,8.778941e+00,1.409443e+04,7.133524e+00,4.827872e-01,3.821413e+01,6.281967e+00,4.963730e+02,2.521065e+01
min,1.000000e+00,2.000000e+00,1.000000e+00,2.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00,1.000000e+00,1.000000e+00,0.000000e+00,1.000000e+00,1.000000e+00,1.000000e+00,3.000000e+00
25%,8.554820e+05,8.561350e+05,5.140900e+04,6.000000e+00,1.000000e+00,1.000000e+01,5.000000e+00,1.351900e+04,3.000000e+00,0.000000e+00,3.100000e+01,4.000000e+00,4.200000e+00,1.400000e+01
50%,1.708865e+06,1.710892e+06,1.025960e+05,1.200000e+01,3.000000e+00,1.300000e+01,8.000000e+00,2.523700e+04,6.000000e+00,1.000000e+00,8.300000e+01,9.000000e+00,7.400000e+00,2.800000e+01
75%,2.565805e+06,2.565520e+06,1.543850e+05,2.500000e+01,5.000000e+00,1.600000e+01,1.500000e+01,3.793300e+04,1.100000e+01,1.000000e+00,1.070000e+02,1.600000e+01,1.130000e+01,4.800000e+01
max,3.421081e+06,3.421083e+06,2.062090e+05,9.900000e+01,6.000000e+00,2.300000e+01,3.000000e+01,4.968800e+04,1.450000e+02,1.000000e+00,1.340000e+02,2.100000e+01,9.999900e+04,9.900000e+01

In [28]:
ords_prods_merge.columns

Index(['Unnamed: 0', 'order_id', 'user_id', 'eval_set', 'order_number',
       'order_dow', 'order_hour_of_day', 'days_since_prior_order',
       'product_id', 'add_to_cart_order', 'reordered', '_merge',
       'product_name', 'aisle_id', 'department_id', 'prices', 'max_order',
       'loyalty_flag', 'spending_flag', 'order_frequency_flag'],
      dtype='object')

In [29]:
#rename Age as age 
ords_prods_merge.rename(columns = {'order_dow' : 'order_day_of_week'}, inplace = True)

In [30]:
# Or summary stats for all columns (including object/categorical)
ords_prods_merge.describe(include='all')

,Unnamed: 0,order_id,user_id,eval_set,order_number,order_day_of_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,_merge,product_name,aisle_id,department_id,prices,max_order,loyalty_flag,spending_flag,order_frequency_flag
count,3.035696e+07,3.035696e+07,3.035696e+07,30356957,3.035696e+07,3.035696e+07,3.035696e+07,3.035696e+07,3.035696e+07,3.035696e+07,3.035696e+07,30356957,30328763,3.032876e+07,3.032876e+07,3.032876e+07,3.035696e+07,30356957,30356957,30356957
unique,NaN,NaN,NaN,1,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1,49630,NaN,NaN,NaN,NaN,3,2,3
top,NaN,NaN,NaN,prior,NaN,NaN,NaN,NaN,NaN,NaN,NaN,both,Banana,NaN,NaN,NaN,NaN,Regular customer,Low spender,Frequent customer
freq,NaN,NaN,NaN,30356957,NaN,NaN,NaN,NaN,NaN,NaN,NaN,30356957,443031,NaN,NaN,NaN,NaN,15095623,29758265,20692982
mean,1.709803e+06,1.710736e+06,1.029339e+05,NaN,1.824695e+01,2.740779e+00,1.341124e+01,1.110414e+01,2.557424e+04,8.354155e+00,6.300634e-01,NaN,NaN,7.119183e+01,9.922036e+00,1.197725e+01,3.420227e+01,NaN,NaN,NaN
std,9.865039e+05,9.872460e+05,5.946892e+04,NaN,1.759162e+01,2.087926e+00,4.246811e+00,8.778941e+00,1.409443e+04,7.133524e+00,4.827872e-01,NaN,NaN,3.821413e+01,6.281967e+00,4.963730e+02,2.521065e+01,NaN,NaN,NaN
min,1.000000e+00,2.000000e+00,1.000000e+00,NaN,2.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00,1.000000e+00,1.000000e+00,0.000000e+00,NaN,NaN,1.000000e+00,1.000000e+00,1.000000e+00,3.000000e+00,NaN,NaN,NaN
25%,8.554820e+05,8.561350e+05,5.140900e+04,NaN,6.000000e+00,1.000000e+00,1.000000e+01,5.000000e+00,1.351900e+04,3.000000e+00,0.000000e+00,NaN,NaN,3.100000e+01,4.000000e+00,4.200000e+00,1.400000e+01,NaN,NaN,NaN
50%,1.708865e+06,1.710892e+06,1.025960e+05,NaN,1.200000e+01,3.000000e+00,1.300000e+01,8.000000e+00,2.523700e+04,6.000000e+00,1.000000e+00,NaN,NaN,8.300000e+01,9.000000e+00,7.400000e+00,2.800000e+01,NaN,NaN,NaN
75%,2.565805e+06,2.565520e+06,1.543850e+05,NaN,2.500000e+01,5.000000e+00,1.600000e+01,1.500000e+01,3.793300e+04,1.100000e+01,1.000000e+00,NaN,NaN,1.070000e+02,1.600000e+01,1.130000e+01,4.800000e+01,NaN,NaN,NaN
max,3.421081e+06,3.421083e+06,2.062090e+05,NaN,9.900000e+01,6.000000e+00,2.300000e+01,3.000000e+01,4.968800e+04,1.450000e+02,1.000000e+00,NaN,NaN,1.340000e+02,2.100000e+01,9.999900e+04,9.900000e+01,NaN,NaN,NaN

#######'user_id' is the key column to comnbine both dataframes

In [31]:
#Drop the '_merge' column from the ords_prod_merge dataframe
if '_merge' in ords_prods_merge.columns:
    ords_prods_merge = ords_prods_merge.drop('_merge', axis=1)

In [32]:
#check the output 
ords_prods_merge.columns

Index(['Unnamed: 0', 'order_id', 'user_id', 'eval_set', 'order_number',
       'order_day_of_week', 'order_hour_of_day', 'days_since_prior_order',
       'product_id', 'add_to_cart_order', 'reordered', 'product_name',
       'aisle_id', 'department_id', 'prices', 'max_order', 'loyalty_flag',
       'spending_flag', 'order_frequency_flag'],
      dtype='object')

In [33]:
ords_prods_merge.shape

(30356957, 19)

In [34]:
#Merge (join) ords_prods_merge with customers data frame on user_id

ords_prods_merge_custs = ords_prods_merge.merge(
    df_custs, 
    on='user_id', 
    how='inner', 
    suffixes=('', '_cust')  # add a suffix for overlapping columns if needed
)

In [35]:
#check output
ords_prods_merge_custs.shape

(30356957, 26)

In [36]:
ords_prods_merge_custs.head()

,Unnamed: 0,order_id,user_id,eval_set,order_number,order_day_of_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,...,loyalty_flag,spending_flag,order_frequency_flag,gender,state,age,date_joined,number_of_dependants,marital_status,income
0,1,2398795,1,prior,2,3,7,15.0,196,1,...,New customer,Low spender,Non-frequent customer,Female,Alabama,31,2/17/2019,3,married,40423
1,1,2398795,1,prior,2,3,7,15.0,10258,2,...,New customer,Low spender,Non-frequent customer,Female,Alabama,31,2/17/2019,3,married,40423
2,1,2398795,1,prior,2,3,7,15.0,12427,3,...,New customer,Low spender,Non-frequent customer,Female,Alabama,31,2/17/2019,3,married,40423
3,1,2398795,1,prior,2,3,7,15.0,13176,4,...,New customer,Low spender,Non-frequent customer,Female,Alabama,31,2/17/2019,3,married,40423
4,1,2398795,1,prior,2,3,7,15.0,26088,5,...,New customer,Low spender,Non-frequent customer,Female,Alabama,31,2/17/2019,3,married,40423

In [37]:
#To export the dataframe as pickle
ords_prods_merge_custs.to_pickle(os.path.join(path, 'Data', 'Prepared Data', 'ords_prods_merge_custs.pkl'))

In [38]:
ords_prods_merge_custs.head()

,Unnamed: 0,order_id,user_id,eval_set,order_number,order_day_of_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,...,loyalty_flag,spending_flag,order_frequency_flag,gender,state,age,date_joined,number_of_dependants,marital_status,income
0,1,2398795,1,prior,2,3,7,15.0,196,1,...,New customer,Low spender,Non-frequent customer,Female,Alabama,31,2/17/2019,3,married,40423
1,1,2398795,1,prior,2,3,7,15.0,10258,2,...,New customer,Low spender,Non-frequent customer,Female,Alabama,31,2/17/2019,3,married,40423
2,1,2398795,1,prior,2,3,7,15.0,12427,3,...,New customer,Low spender,Non-frequent customer,Female,Alabama,31,2/17/2019,3,married,40423
3,1,2398795,1,prior,2,3,7,15.0,13176,4,...,New customer,Low spender,Non-frequent customer,Female,Alabama,31,2/17/2019,3,married,40423
4,1,2398795,1,prior,2,3,7,15.0,26088,5,...,New customer,Low spender,Non-frequent customer,Female,Alabama,31,2/17/2019,3,married,40423

In [39]:
#To export the dataframe as pickle
ords_prods_merge_custs.to_pickle(os.path.join(path, 'Data', 'Prepared Data', 'ords_prods_merge_custs_4.9.pkl'))